Merge pull request #3 from peteclarkez/purge
Add TP Purge
